**Pandas**
1. library for Data Analysis and Manipulation

**Why Pandas?**
1. provides ability to work with Tabular data.
2.  Tabular Data - data that is organized into tables having rows and cols

In [1]:
# Installing Pandas 
!pip install pandas

Requirement already satisfied: pandas in /opt/anaconda3/lib/python3.11/site-packages (2.1.4)
Requirement already satisfied: numpy<2,>=1.23.2 in /opt/anaconda3/lib/python3.11/site-packages (from pandas) (1.26.4)
Requirement already satisfied: python-dateutil>=2.8.2 in /opt/anaconda3/lib/python3.11/site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in /opt/anaconda3/lib/python3.11/site-packages (from pandas) (2023.3.post1)
Requirement already satisfied: tzdata>=2022.1 in /opt/anaconda3/lib/python3.11/site-packages (from pandas) (2023.3)
Requirement already satisfied: six>=1.5 in /opt/anaconda3/lib/python3.11/site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)

In [2]:
# importing pandas 
import pandas as pd

**Series**
1. Series is a one dimensional labelled array that can hold/store data

In [23]:
programming_language = ['C', 'C++', 'C#', 'Python', 'Java','JavaScript']

In [24]:
# Converting a list into a tabular format or Series
programming_language = pd.Series(programming_language)
programming_language

0             C
1           C++
2            C#
3        Python
4          Java
5    JavaScript
dtype: object

In [25]:
type(programming_language)

pandas.core.series.Series

In [26]:
# indexing through rows 
programming_language[3]

'Python'

In [27]:
# changing index name 
programming_language = ['C', 'C++', 'C#', 'Python', 'Java','JavaScript']
programming_language = pd.Series(programming_language, index=['a','b','c','d','e','f'])
programming_language

a             C
b           C++
c            C#
d        Python
e          Java
f    JavaScript
dtype: object

In [28]:
programming_language.index = ['a','b','c','d','e','f']

In [29]:
programming_language

a             C
b           C++
c            C#
d        Python
e          Java
f    JavaScript
dtype: object

In [30]:
# indexing through new index name 
programming_language['d']

'Python'

**DataFrame**
1. 2D labelled array having index and columns.
2. multiple series combined together to form a Dataframe.
3. most widely used data structure in pandas

In [31]:
import numpy as np

In [32]:
arr = np.random.randint(10,100, size=(6,4))
arr

array([[88, 56, 12, 76],
       [93, 86, 97, 85],
       [69, 14, 64, 95],
       [20, 60, 24, 63],
       [89, 55, 22, 58],
       [59, 72, 71, 98]])

In [33]:
# converting array into dataframe(tabular format)
df = pd.DataFrame(arr)
df

    0   1   2   3
0  88  56  12  76
1  93  86  97  85
2  69  14  64  95
3  20  60  24  63
4  89  55  22  58
5  59  72  71  98

In [34]:
# type of newely created df
type(df)

pandas.core.frame.DataFrame

In [36]:
# changing columns index name [0,1,2,3] into ['A','B','C','D']
df.columns = ['A','B','C','D']
df

    A   B   C   D
0  88  56  12  76
1  93  86  97  85
2  69  14  64  95
3  20  60  24  63
4  89  55  22  58
5  59  72  71  98

In [37]:
# changing columns index name [0,1,2,3] into ['A','B','C','D']
df = pd.DataFrame(arr, columns=['A','B','C','D'])
df

    A   B   C   D
0  88  56  12  76
1  93  86  97  85
2  69  14  64  95
3  20  60  24  63
4  89  55  22  58
5  59  72  71  98

In [39]:
# How may rows and colums in df: (6rows and 4columns)
df.shape

(6, 4)

In [40]:
# indexing 'D' column
df['D']

0    76
1    85
2    95
3    63
4    58
5    98
Name: D, dtype: int64

In [42]:
# indexing multiple column: 'B','C','D'
df[['B','C','D']]

    B   C   D
0  56  12  76
1  86  97  85
2  14  64  95
3  60  24  63
4  55  22  58
5  72  71  98

In [44]:
# Adding new column A+B Which is addition of column A and B
df["A+B"]= df['A']+ df['B']
df

    A   B   C   D  A+B
0  88  56  12  76  144
1  93  86  97  85  179
2  69  14  64  95   83
3  20  60  24  63   80
4  89  55  22  58  144
5  59  72  71  98  131

In [52]:
df["A-B"]= df['A']- df['B']
df

    A   B   C   D  A+B  A-B
0  88  56  12  76  144   32
1  93  86  97  85  179    7
2  69  14  64  95   83   55
3  20  60  24  63   80  -40
4  89  55  22  58  144   34
5  59  72  71  98  131  -13

In [53]:
# Droping column A-B
df.drop(columns=['A-B'])

    A   B   C   D  A+B
0  88  56  12  76  144
1  93  86  97  85  179
2  69  14  64  95   83
3  20  60  24  63   80
4  89  55  22  58  144
5  59  72  71  98  131

In [54]:
df

    A   B   C   D  A+B  A-B
0  88  56  12  76  144   32
1  93  86  97  85  179    7
2  69  14  64  95   83   55
3  20  60  24  63   80  -40
4  89  55  22  58  144   34
5  59  72  71  98  131  -13

In [55]:
# A-B Column is not permanently deleted to delete it permanently use inplace= True 
df.drop(columns=['A-B'], inplace=True)
df

    A   B   C   D  A+B
0  88  56  12  76  144
1  93  86  97  85  179
2  69  14  64  95   83
3  20  60  24  63   80
4  89  55  22  58  144
5  59  72  71  98  131

**INDEXING or Extracting Data through rows**

In [57]:
df

    A   B   C   D  A+B
0  88  56  12  76  144
1  93  86  97  85  179
2  69  14  64  95   83
3  20  60  24  63   80
4  89  55  22  58  144
5  59  72  71  98  131

In [64]:
# changing rows index value [0,1,2,3,4,5] into ['a','b','c','d','e','f']
# OR
# df.index = "a,b,c,d,e,f".split()
df.index = ['a','b','c','d','e','f']

In [65]:
df

    A   B   C   D  A+B
a  88  56  12  76  144
b  93  86  97  85  179
c  69  14  64  95   83
d  20  60  24  63   80
e  89  55  22  58  144
f  59  72  71  98  131

In [66]:
# loc - location : using rows index 
df.loc['a']

A       88
B       56
C       12
D       76
A+B    144
Name: a, dtype: int64

In [67]:
df.loc['f']

A       59
B       72
C       71
D       98
A+B    131
Name: f, dtype: int64

In [69]:
# iloc - integer location to print rows using index integer 0,1,2,3...... 
df.iloc[0]

A       88
B       56
C       12
D       76
A+B    144
Name: a, dtype: int64

In [71]:
df.iloc[1]

A       93
B       86
C       97
D       85
A+B    179
Name: b, dtype: int64

In [72]:
df

    A   B   C   D  A+B
a  88  56  12  76  144
b  93  86  97  85  179
c  69  14  64  95   83
d  20  60  24  63   80
e  89  55  22  58  144
f  59  72  71  98  131

In [74]:
# To print only 1st and 2nd rows 
df.iloc[0:2]

    A   B   C   D  A+B
a  88  56  12  76  144
b  93  86  97  85  179

In [75]:
# To print only 1st and 2nd rows and the colum C and D 
df.iloc[0:2, 2:4]

    C   D
a  12  76
b  97  85

In [79]:
# To print only 1st and 2nd rows and the colum C and D 
df.iloc[0:2][['C','D']]

    C   D
a  12  76
b  97  85

In [80]:
# To print two last rows and colum 
df.iloc[-2: , -2:]

    D  A+B
e  58  144
f  98  131

**Masking/Boolean-Indexing**

In [81]:
df

    A   B   C   D  A+B
a  88  56  12  76  144
b  93  86  97  85  179
c  69  14  64  95   83
d  20  60  24  63   80
e  89  55  22  58  144
f  59  72  71  98  131

In [82]:
# masking and listing dataframe value greater then 40 = True and less then 40 = False 
mask = df>40
mask

       A      B      C     D   A+B
a   True   True  False  True  True
b   True   True   True  True  True
c   True  False   True  True  True
d  False   True  False  True  True
e   True   True  False  True  True
f   True   True   True  True  True

In [84]:
# In false place we see NaN
df[mask]

      A     B     C   D  A+B
a  88.0  56.0   NaN  76  144
b  93.0  86.0  97.0  85  179
c  69.0   NaN  64.0  95   83
d   NaN  60.0   NaN  63   80
e  89.0  55.0   NaN  58  144
f  59.0  72.0  71.0  98  131

In [88]:
# Masking column wise 
new_mask = df['A']>40
new_mask

a     True
b     True
c     True
d    False
e     True
f     True
Name: A, dtype: bool

In [89]:
# Check colum 'A' less than 40 value and Remove rows that is less than 40 
df[new_mask]

    A   B   C   D  A+B
a  88  56  12  76  144
b  93  86  97  85  179
c  69  14  64  95   83
e  89  55  22  58  144
f  59  72  71  98  131

In [90]:
df

    A   B   C   D  A+B
a  88  56  12  76  144
b  93  86  97  85  179
c  69  14  64  95   83
d  20  60  24  63   80
e  89  55  22  58  144
f  59  72  71  98  131

In [92]:
df['A']>40

a     True
b     True
c     True
d    False
e     True
f     True
Name: A, dtype: bool

In [93]:
df['B']>50

a     True
b     True
c    False
d     True
e     True
f     True
Name: B, dtype: bool

In [97]:
# use & operator as masking
(df['A']>40) & (df['B']>50)

a     True
b     True
c    False
d    False
e     True
f     True
dtype: bool

In [98]:
# shows only ture data and remove false data 
df[(df['A']>40) & (df['B']>50)]

    A   B   C   D  A+B
a  88  56  12  76  144
b  93  86  97  85  179
e  89  55  22  58  144
f  59  72  71  98  131

In [99]:
df

    A   B   C   D  A+B
a  88  56  12  76  144
b  93  86  97  85  179
c  69  14  64  95   83
d  20  60  24  63   80
e  89  55  22  58  144
f  59  72  71  98  131

In [100]:
# converting df into array 
new_arr = df.values
new_arr

array([[ 88,  56,  12,  76, 144],
       [ 93,  86,  97,  85, 179],
       [ 69,  14,  64,  95,  83],
       [ 20,  60,  24,  63,  80],
       [ 89,  55,  22,  58, 144],
       [ 59,  72,  71,  98, 131]])

In [101]:
# again coverting new_arr into dataframe 
new_df = pd.DataFrame(new_arr)
new_df

    0   1   2   3    4
0  88  56  12  76  144
1  93  86  97  85  179
2  69  14  64  95   83
3  20  60  24  63   80
4  89  55  22  58  144
5  59  72  71  98  131